## plan (prd)

Parameter: none

✓ Plan successfull
✓ Plan summary:

| CHANGE |                                                      RESOURCE                                                       |
|--------|---------------------------------------------------------------------------------------------------------------------|
| add    | `module.resource_group["eastus"].azurerm_resource_group.this`                                                       |
|        | `module.resource_group["germanywestcentral"].azurerm_resource_group.this`                                           |
|        | `module.vnet["eastus"].module.subnet["sub1"].azurerm_network_security_group.this[0]`                                |
|        | `module.vnet["eastus"].module.subnet["sub1"].azurerm_subnet.this`                                                   |
|        | `module.vnet["eastus"].module.subnet["sub1"].azurerm_subnet_network_security_group_association.this[0]`             |
|        | `module.vnet["eastus"].module.vnet[0].azurerm_virtual_network.this`                                                 |
|        | `module.vnet["eastus"].random_bytes.this[0]`                                                                        |
|        | `module.vnet["eastus"].terraform_data.dcl_pre_checks`                                                               |
|        | `module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_network_security_group.this[0]`                    |
|        | `module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_subnet.this`                                       |
|        | `module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_subnet_network_security_group_association.this[0]` |
|        | `module.vnet["germanywestcentral"].module.vnet[0].azurerm_virtual_network.this`                                     |
|        | `module.vnet["germanywestcentral"].random_bytes.this[0]`                                                            |
|        | `module.vnet["germanywestcentral"].terraform_data.dcl_pre_checks`                                                   |
✓ Plan Details:

<details>

<summary>Details of tofu plan</summary>

```console


OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # module.resource_group["eastus"].azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = "eastus"
      + managed_by = "1018b490-2e4d-48b5-b103-ca74855887d4"
      + name       = "on-eus1-prd-vdi-rg"
      + tags       = {
          + "OPS:Environment"     = "PRD"
          + "OPS:Source"          = "otc-code/res-azr-rg-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
    }

  # module.resource_group["germanywestcentral"].azurerm_resource_group.this will be created
  + resource "azurerm_resource_group" "this" {
      + id         = (known after apply)
      + location   = "germanywestcentral"
      + managed_by = "1018b490-2e4d-48b5-b103-ca74855887d4"
      + name       = "on-gwce-prd-vdi-rg"
      + tags       = {
          + "OPS:Environment"     = "PRD"
          + "OPS:Source"          = "otc-code/res-azr-rg-v1.0.0"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }
    }

  # module.vnet["eastus"].data.azurerm_virtual_network.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "this" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "on-eus1-prd-vdi-vnet"
      + resource_group_name     = "on-eus1-prd-vdi-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.vnet["eastus"].random_bytes.this[0] will be created
  + resource "random_bytes" "this" {
      + base64 = (sensitive value)
      + hex    = (sensitive value)
      + length = 5
    }

  # module.vnet["eastus"].terraform_data.dcl_pre_checks will be created
  + resource "terraform_data" "dcl_pre_checks" {
      + id = (known after apply)
    }

  # module.vnet["germanywestcentral"].data.azurerm_virtual_network.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_virtual_network" "this" {
      + address_space           = (known after apply)
      + dns_servers             = (known after apply)
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = (known after apply)
      + name                    = "on-gwce-prd-vdi-vnet"
      + resource_group_name     = "on-gwce-prd-vdi-rg"
      + subnets                 = (known after apply)
      + tags                    = (known after apply)
      + vnet_peerings           = (known after apply)
      + vnet_peerings_addresses = (known after apply)
    }

  # module.vnet["germanywestcentral"].random_bytes.this[0] will be created
  + resource "random_bytes" "this" {
      + base64 = (sensitive value)
      + hex    = (sensitive value)
      + length = 5
    }

  # module.vnet["germanywestcentral"].terraform_data.dcl_pre_checks will be created
  + resource "terraform_data" "dcl_pre_checks" {
      + id = (known after apply)
    }

  # module.vnet["eastus"].module.subnet["sub1"].azurerm_network_security_group.this[0] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "on-eus1-prd-vdi-vnet-sub-1-vm-sg"
      + resource_group_name = "on-eus1-prd-vdi-rg"
      + security_rule       = (known after apply)
    }

  # module.vnet["eastus"].module.subnet["sub1"].azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "on-eus1-prd-vdi-vnet-sub-1-vm"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "on-eus1-prd-vdi-rg"
      + virtual_network_name                          = "on-eus1-prd-vdi-vnet"
    }

  # module.vnet["eastus"].module.subnet["sub1"].azurerm_subnet_network_security_group_association.this[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.vnet["eastus"].module.vnet[0].azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space           = (known after apply)
      + dns_servers             = []
      + flow_timeout_in_minutes = 5
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "eastus"
      + name                    = "on-eus1-prd-vdi-vnet"
      + resource_group_name     = "on-eus1-prd-vdi-rg"
      + subnet                  = (known after apply)
      + tags                    = {
          + "OPS:Environment"     = "PRD"
          + "OPS:Source"          = "otc-code/res-azr-vnet-main"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }

      + encryption {
          + enforcement = "AllowUnencrypted"
        }
    }

  # module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_network_security_group.this[0] will be created
  + resource "azurerm_network_security_group" "this" {
      + id                  = (known after apply)
      + location            = "germanywestcentral"
      + name                = "on-gwce-prd-vdi-vnet-sub-1-vm-sg"
      + resource_group_name = "on-gwce-prd-vdi-rg"
      + security_rule       = (known after apply)
    }

  # module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_subnet.this will be created
  + resource "azurerm_subnet" "this" {
      + address_prefixes                              = (known after apply)
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "on-gwce-prd-vdi-vnet-sub-1-vm"
      + private_endpoint_network_policies             = "Enabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "on-gwce-prd-vdi-rg"
      + virtual_network_name                          = "on-gwce-prd-vdi-vnet"
    }

  # module.vnet["germanywestcentral"].module.subnet["sub1"].azurerm_subnet_network_security_group_association.this[0] will be created
  + resource "azurerm_subnet_network_security_group_association" "this" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.vnet["germanywestcentral"].module.vnet[0].azurerm_virtual_network.this will be created
  + resource "azurerm_virtual_network" "this" {
      + address_space           = (known after apply)
      + dns_servers             = []
      + flow_timeout_in_minutes = 5
      + guid                    = (known after apply)
      + id                      = (known after apply)
      + location                = "germanywestcentral"
      + name                    = "on-gwce-prd-vdi-vnet"
      + resource_group_name     = "on-gwce-prd-vdi-rg"
      + subnet                  = (known after apply)
      + tags                    = {
          + "OPS:Environment"     = "PRD"
          + "OPS:Source"          = "otc-code/res-azr-vnet-main"
          + "OPS:State"           = "NONPROD"
          + "ORG:ApplicationName" = "vdi"
          + "SEC:DCL"             = "basic"
        }

      + encryption {
          + enforcement = "AllowUnencrypted"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```
</details>


✓ tofu plan: 14 to add, 0 to change, 0 to destroy.
